# Profile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..Profile Property
BeamSystem Class See Also
---
Retrieve or set the profile of the BeamSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray Profile { get; set; }
```

Visual Basic
---
```text
Public Property Profile As CurveArray
	Get
	Set
```

Visual C++
---
```text
public:
property CurveArray^ Profile {
	CurveArray^ get ();
	void set (CurveArray^ value);
}
```

# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace